{
    "divisionalLegends": {},
    "divisionalEnrolmentIndicators": {
        "APSC": [],
        "FIS": [],
        "MUSIC": [
            {
                "code": "C",
                "name": "Students can enrol in the course; final confirmation will be based on audition/interview during the first week of September."
            },
            {
                "code": "E",
                "name": "The Registrar’s Office will add you to this course, once you have met the enrolment condition. This could include being enrolled in a certain program/ year of study, a placement audition, or approval of a proposal."
            },
            {
                "code": "R",
                "name": "The course is restricted to students in the specific program/year indicated at all times. Enrolment for others is only an option by obtaining written permission from the instructor of the course. Instructors may require an audition/interview prior to giving permission."
            },
            {
                "code": "P",
                "name": "Students enrolled in the specific programs/year indicated will receive priority during the first round of enrolment (July 9-25). During the second round of enrolment, the remaining spaces, if any, will be available to all students."
            }
        ],
        "ERIN": [
            {
                "code": "A",
                "name": "Departmental approval is required. The course will appear on student's ACORN record with a status of INTerim until the department has had an opportunity to review students' requests and APProve or REFuse the course. Fees charges will not appear on the student invoice until an APProved status is assigned."
            },
            {
                "code": "R",
                "name": "The course is restricted at all times to students in the following groups:"
            },
            {
                "code": "R1",
                "name": "The course is restricted at all times to students in the following groups:"
            },
            {
                "code": "AP",
                "name": "ACORN record with a status of INTerim until the department has had an opportunity to review students' requests and APProve or REFuse the course) and priority is given to certain groups of students to enrol first and then the course becomes available to other UTM students on July 23 2025 at 6 am. August 6, 2025 at 6 am is the first day UTM students can add St. George/UTSC courses, and St. George/UTSC students can add UTM courses."
            },
            {
                "code": "AR",
                "name": "Departmental approval is required for the course. The course will appear on student's ACORN record with a status of INTerim until the department has had an opportunity to review students' requests and APProve or REFuse the course. Fees charges will not appear on the student invoice until an APProved status is assigned. The course is restricted at all times to students in the following groups:"
            },
            {
                "code": "E",
                "name": "Enrolment through ACORN is not available. Students must enrol through the department. Departmental approval is required."
            },
            {
                "code": "P",
                "name": "Priority is given to certain groups of students to enrol first and then the course becomes available to other UTM students on July 23 2025 at 6 am. August 6, 2025 at 6 am is the first day UTM students can add St. George/UTSC courses, and St. George/UTSC students can add UTM courses."
            }
        ],
        "SCAR": [
            {
                "code": "R",
                "name": "This course is restricted to students in the following groups:"
            },
            {
                "code": "A",
                "name": "Students request the course on ACORN but will not be officially enrolled until approval has been granted. Check your status through ACORN to see whether you have been approved. (APP = approval; REF = refused; INT = no decision yet). <br><br> Enrollment will open to UTSG and UTM students on August 6, 2025."
            },
            {
                "code": "E",
                "name": "Enrolment through ACORN is not available."
            },
            {
                "code": "P",
                "name": "Priority is given to certain groups of students until 10am on July 23, 2025, then the course becomes available to all UTSC students. Enrollment will open to UTSG and UTM students on August 6, 2025. Currently, students in the following programs can enroll:"
            },
            {
                "code": "AP",
                "name": "Students request the course on ACORN but will not be officially enrolled until approval has been granted. Check your status through ACORN to see whether you have been approved. (APP = approval; REF = refused; INT = no decision yet).\n<br><br>\nPriority is given to certain groups of students until 10am on July 23, 2025, then the course becomes available to all UTSC students. Enrollment will open to UTSG and UTM students on August 6, 2025. Currently, students in the following programs can enroll:"
            },
            {
                "code": "AR",
                "name": "Students request the course on ACORN but will not be officially enrolled until approval has been granted. Check your status through ACORN to see whether you have been approved. (APP = approval; REF = refused; INT = no decision yet).\n<br><br>\nThis course is restricted to students in the following groups:"
            },
            {
                "code": "RP",
                "name": "Priority is given to certain groups of students until 10am on July 23, 2025, then the course will become available to an additional group of students. Currently, students in the following programs can enroll:"
            },
            {
                "code": "RP*",
                "name": "Students request the course on ACORN but will not be officially enrolled until approval has been granted. Check your status through ACORN to see whether you have been approved. (APP = approval; REF = refused; INT = no decision yet).\n<br><br>\nPriority is given to certain groups of students until 10am on July 23, 2025, then the course will become available to an additional group of students. Currently, students in the following programs can enroll:"
            }
        ],
        "ARTSC": [
            {
                "code": "E",
                "name": "Enrolment via ACORN is not available. Students must request permission to enrol in this course by contacting the sponsoring department"
            },
            {
                "code": "R1",
                "name": "Restricted: Course/section is restricted at all times for specific students."
            },
            {
                "code": "R1*",
                "name": "Restricted: Course/section is restricted at all times for specific students. NOTE: Spaces for each priority group in this course are not equal, and each priority group has its own waitlist until July 23. As of July 25, the waitlists for each priority group merge into one, and your rank on the waitlist may change."
            },
            {
                "code": "P",
                "name": "Priority enrolment is given to certain students until July 23. As of July 25 other Arts & Science students can begin to enrol. Beginning July 30, other St. George campus students can enrol in this section. UTM/UTSC students can enrol in this section starting August 6. Currently the following groups of students can enrol:"
            },
            {
                "code": "P*",
                "name": "Priority: NOTE: Spaces for each priority group in this course are not equal, and each priority group has its own waitlist until July 23. As of July 25, the waitlists for each priority group merge into one, and your rank on the waitlist may change; this is also when other Arts & Science students can begin to enrol. Beginning July 30 other St. George campus students can enrol in this section.  UTM/UTSC students can enrol in this section starting August 6. Currently the following groups of students can enrol:"
            },
            {
                "code": "R2",
                "name": "This section is restricted to two groups of students. Group 1 is given priority access until July 23. Beginning July 25, Group 2 can enrol in this section. Currently the following groups of students can enrol in this section:"
            },
            {
                "code": "R2*",
                "name": "This section is restricted to two groups of students. NOTE: Spaces for each priority group in this course are not equal, and each priority group has its own waitlist until July 26. As of July 28, the waitlists for each priority group merge into one, and your rank on the waitlist may change. Group 1 is given priority access until July 26. Beginning July 28, Group 2 can enrol in this section. Currently the following groups of students can enrol in this section:"
            },
            {
                "code": "A",
                "name": "This section requires approval for enrolment. The course can be requested on ACORN and will be added with an interim (INT) status which will then either be approved (APP) or refused (REF) by the academic unit."
            },
            {
                "code": "AP",
                "name": "Priority enrolment is given to certain students until July 23. As of July 25 other Arts & Science students can begin to enrol. Beginning July 30, other St. George campus students can enrol in this section. UTM/UTSC students can enrol in this section starting August 6. This section also requires approval for enrolment. The course can be requested on ACORN and will be added with an interim (INT) status which will then either be approved (APP) or refused (REF) by the academic unit. Currently the following groups of students can enrol"
            },
            {
                "code": "AR1",
                "name": "Restricted: Course/section is restricted at all times for specific students. This section also requires approval for enrolment. The course can be requested on ACORN and will be added with an interim (INT) status which will then either be approved (APP) or refused (REF) by the academic unit."
            }
        ],
        "FPEH": [
            {
                "code": "E",
                "name": "<p>Enrol via KPE Registrar’s Office. Students must enrol via the relevant process as administered by the KPE Registrar’s Office. <a href=\"https://kpe.utoronto.ca/academics-researchcurrent-studentsundergraduate-studies/bkin-field-learning\" class=\"external-link\" target=\"_blank\" rel=\"nofollow noopener\">https://kpe.utoronto.ca/academics-researchcurrent-studentsundergraduate-studies/bkin-field-learning</a>.</p>"
            },
            {
                "code": "AE",
                "name": "<p>Enrol via KPE Registrar’s Office. Students must enrol via the relevant process as administered by the KPE Registrar’s Office. <a href=\"https://kpe.utoronto.ca/academics-researchcurrent-studentsundergraduate-studies/bkin-research\" class=\"external-link\" target=\"_blank\" rel=\"nofollow noopener\">https://kpe.utoronto.ca/academics-researchcurrent-studentsundergraduate-studies/bkin-research</a>.</p>"
            }
        ],
        "ARCLA": [
            {
                "code": "E",
                "name": "Enrolment is not available via ACORN. See the course 'notes' for dates/details on when and how to enrol in this course."
            },
            {
                "code": "P",
                "name": "Priority Enrolment - Currently the following groups of students are able to enrol in this course:"
            },
            {
                "code": "R",
                "name": "Enrolment is restricted in this course at all times to the following groups of students:"
            }
        ]
    }
}